DELETE FROM demands;
DELETE FROM masters;
DELETE FROM slots;

INSERT INTO demands  (vk_id, for_week, first_name, last_name, players_count, slots)
VALUES (0, '2025-08-04T00:00:00Z', 'Иван', 'Пупкин',1, '[
      {
        "id": 13,
        "name": "пн вечер",
        "valid_from": "2020-01-01",
        "valid_until": "9999-01-01"
      },
      {
        "id": 23,
        "name": "вт вечер",
        "valid_from": "2020-01-01",
        "valid_until": "9999-01-01"
      }
    ]'::jsonb),

       (1, '2025-08-04T00:00:00Z', 'Мария', 'Залупкина',2, '[
      {
        "id": 61,
        "name": "сб утро",
        "valid_from": "2020-01-01",
        "valid_until": "9999-01-01"
      }
    ]'::jsonb);

INSERT INTO slots (id, name, valid_from, valid_until)
VALUES
    (13, 'пн вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (23, 'вт вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (33, 'ср вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (43, 'чт вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (53, 'пт вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (51, 'пт утро','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (61, 'сб утро','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (63, 'сб вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (71, 'вс утро','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' ),
    (73, 'вс вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' )
;

INSERT INTO slots_default (id, name)
VALUES
    (13, 'пн вечер' ),
    (23, 'вт вечер' ),
    (33, 'ср вечер'),
    (43, 'чт вечер'),
    (53, 'пт вечер'),
    (51, 'пт утро' ),
    (61, 'сб утро' ),
    (63, 'сб вечер' ),
    (71, 'вс утро' ),
    (73, 'вс вечер' )
;

INSERT INTO masters (id, name, vk_id)
VALUES (0, 'Богдан', 111),
       (1, 'Даниль', 999);