-- DELETE FROM demands;
DELETE FROM masters;
DELETE FROM slots;
DELETE FROM slots_default;

INSERT INTO slots (id, name, valid_from, valid_until, for_week_str)
VALUES
    (53, 'пт вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z', '2026-08-03' ),
    (61, 'сб утро','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' , '2026-08-03'),
    (63, 'сб вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' , '2026-08-03'),
    (71, 'вс утро','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z', '2026-08-03' ),
    (73, 'вс вечер','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' , '2026-08-03')
on conflict do nothing;

INSERT INTO slots_default (id, name,  valid_from, valid_until, for_week_str)
VALUES
    (53, 'пятница вечер 18-23','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z', '1970-01-01' ),
    (61, 'суббота утро 12-17','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' , '1970-01-01' ),
    (63, 'суббота вечер 18-23','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' , '1970-01-01' ),
    (71, 'воскресенье утро 12-17','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z' , '1970-01-01' ),
    (73, 'воскресенье вечер 18-23','1970-01-01T00:00:00Z', '9999-12-31T23:59:00Z', '1970-01-01'  )
on conflict do nothing;

INSERT INTO masters (id, name, vk_id, created_at, updated_at)
VALUES (0, 'Богдан', 111, '2025-08-04T00:00:00Z','2025-08-04T00:00:00Z'),
       (1, 'Даниль', 999,'2025-08-04T00:00:00Z','2025-08-04T00:00:00Z')
on conflict do nothing;